
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Ramda及函数式编程 · 函数式编程Ramda</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Leooman">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-anchor-navigation-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="Type.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" >
            
                <a target="_blank" href="https://github.com/Leooman/ramda">
            
                    
                    Ramda V0.25.0
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">前言</li>
        
        
    
        <li class="chapter active" data-level="2.1" data-path="./">
            
                <a href="./">
            
                    
                    Ramda及函数式编程
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">目录</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="Type.html">
            
                <a href="Type.html">
            
                    
                    类型Type
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="Math.html">
            
                <a href="Math.html">
            
                    
                    数学运算Math
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="Logic.html">
            
                <a href="Logic.html">
            
                    
                    逻辑运算Logic
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="Relation.html">
            
                <a href="Relation.html">
            
                    
                    关系运算Relation
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="String.html">
            
                <a href="String.html">
            
                    
                    字符串String
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.6" data-path="List.html">
            
                <a href="List.html">
            
                    
                    数组List
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.7" data-path="Object.html">
            
                <a href="Object.html">
            
                    
                    对象Object
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.8" data-path="Function.html">
            
                <a href="Function.html">
            
                    
                    函数Function
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Ramda及函数式编程</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div id="anchor-navigation-ex-navbar"><i class="fa fa-anchor"></i><ul><li><a href="#&#x7B80;&#x4ECB;">&#x7B80;&#x4ECB;</a></li><ul><li><a href="#&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;">&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;</a></li><li><a href="#&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;">&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;</a></li><li><a href="#why-ramda">Why Ramda</a></li></ul></ul></div><a href="#&#x7B80;&#x4ECB;" id="anchorNavigationExGoTop"><i class="fa fa-arrow-up"></i></a><h1 id="&#x7B80;&#x4ECB;"><a name="&#x7B80;&#x4ECB;" class="anchor-navigation-ex-anchor" href="#&#x7B80;&#x4ECB;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x7B80;&#x4ECB;</h1>
<h2 id="&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;"><a name="&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;" class="anchor-navigation-ex-anchor" href="#&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;</h2>
<p>&#x5728;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#xFF08;&#x82F1;&#x8BED;&#xFF1A;Object-oriented programming&#xFF0C;&#x7F29;&#x5199;&#xFF1A;OOP&#xFF09;&#x662F;&#x79CD;&#x5177;&#x6709;&#x5BF9;&#x8C61;&#x6982;&#x5FF5;&#x7684;&#x7A0B;&#x5E8F;&#x7F16;&#x7A0B;&#x8303;&#x578B;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5B83;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x6570;&#x636E;&#x3001;&#x5C5E;&#x6027;&#x3001;&#x4EE3;&#x7801;&#x4E0E;&#x65B9;&#x6CD5;&#x3002;&#x5BF9;&#x8C61;&#x5219;&#x6307;&#x7684;&#x662F;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x3002;</p>
<p>&#x5728;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7A0B;&#x5E8F;&#x7F16;&#x7A0B;&#x91CC;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x4F1A;&#x88AB;&#x8BBE;&#x8BA1;&#x6210;&#x5F7C;&#x6B64;&#x76F8;&#x5173;&#x7684;&#x5BF9;&#x8C61; &#xFF0C;&#x5C06;&#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;&#x7A0B;&#x5E8F;&#x7684;&#x57FA;&#x672C;&#x5355;&#x5143;&#x3002;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x90FD;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x63A5;&#x53D7;&#x6570;&#x636E;&#x3001;&#x5904;&#x7406;&#x6570;&#x636E;&#x5E76;&#x5C06;&#x6570;&#x636E;&#x4F20;&#x8FBE;&#x7ED9;&#x5176;&#x5B83;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x76EE;&#x524D;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x63A8;&#x5E7F;&#x4E86;&#x7A0B;&#x5E8F;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x548C;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x5927;&#x578B;&#x9879;&#x76EE;&#x8BBE;&#x8BA1;&#x4E2D;&#x5E7F;&#x4E3A;&#x5E94;&#x7528;&#x3002;&#x80FD;&#x591F;&#x8BA9;&#x4EBA;&#x4EEC;&#x66F4;&#x7B80;&#x5355;&#x5730;&#x8BBE;&#x8BA1;&#x5E76;&#x7EF4;&#x62A4;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F7F;&#x5F97;&#x7A0B;&#x5E8F;&#x66F4;&#x52A0;&#x4FBF;&#x4E8E;&#x5206;&#x6790;&#x3001;&#x8BBE;&#x8BA1;&#x3001;&#x7406;&#x89E3;&#x3002;&#x540C;&#x65F6;&#x5B83;&#x4E5F;&#x662F;&#x6613;&#x62D3;&#x5C55;&#x7684;&#xFF0C;&#x7531;&#x4E8E;&#x7EE7;&#x627F;&#x3001;&#x5C01;&#x88C5;&#x3001;&#x591A;&#x6001;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x81EA;&#x7136;&#x8BBE;&#x8BA1;&#x51FA;&#x9AD8;&#x5185;&#x805A;&#x3001;&#x4F4E;&#x8026;&#x5408;&#x7684;&#x7CFB;&#x7EDF;&#x7ED3;&#x6784;&#xFF0C;&#x4F7F;&#x5F97;&#x7CFB;&#x7EDF;&#x66F4;&#x7075;&#x6D3B;&#x3001;&#x66F4;&#x5BB9;&#x6613;&#x6269;&#x5C55;&#xFF0C;&#x800C;&#x4E14;&#x6210;&#x672C;&#x8F83;&#x4F4E;&#x3002;</p>
<p>&#x5728;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x53D1;&#x5C55;&#x51FA;&#x6765;&#x7684;23&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#x4E8E;&#x73B0;&#x4ECA;&#x7684;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x4E2D;&#xFF0C;&#x6781;&#x5927;&#x65B9;&#x4FBF;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x4E66;&#x5199;&#x4E0E;&#x7EF4;&#x62A4;&#x3002;</p>
<p>&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;&#xFF0C;&#x5171;&#x4E94;&#x79CD;&#xFF1A;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x3001;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x3001;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x3001;&#x5EFA;&#x9020;&#x8005;&#x6A21;&#x5F0F;&#x3001;&#x539F;&#x578B;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x7ED3;&#x6784;&#x578B;&#x6A21;&#x5F0F;&#xFF0C;&#x5171;&#x4E03;&#x79CD;&#xFF1A;&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#x3001;&#x88C5;&#x9970;&#x5668;&#x6A21;&#x5F0F;&#x3001;&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#x3001;&#x5916;&#x89C2;&#x6A21;&#x5F0F;&#x3001;&#x6865;&#x63A5;&#x6A21;&#x5F0F;&#x3001;&#x7EC4;&#x5408;&#x6A21;&#x5F0F;&#x3001;&#x4EAB;&#x5143;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x884C;&#x4E3A;&#x578B;&#x6A21;&#x5F0F;&#xFF0C;&#x5171;&#x5341;&#x4E00;&#x79CD;&#xFF1A;&#x7B56;&#x7565;&#x6A21;&#x5F0F;&#x3001;&#x6A21;&#x677F;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x3001;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x3001;&#x8FED;&#x4EE3;&#x5B50;&#x6A21;&#x5F0F;&#x3001;&#x8D23;&#x4EFB;&#x94FE;&#x6A21;&#x5F0F;&#x3001;&#x547D;&#x4EE4;&#x6A21;&#x5F0F;&#x3001;&#x5907;&#x5FD8;&#x5F55;&#x6A21;&#x5F0F;&#x3001;&#x72B6;&#x6001;&#x6A21;&#x5F0F;&#x3001;&#x8BBF;&#x95EE;&#x8005;&#x6A21;&#x5F0F;&#x3001;&#x4E2D;&#x4ECB;&#x8005;&#x6A21;&#x5F0F;&#x3001;&#x89E3;&#x91CA;&#x5668;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x4EE5;&#x6570;&#x636E;&#x4E3A;&#x6838;&#x5FC3;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x540C;&#x65F6;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x4FEE;&#x6539;&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x3002; </p>
<h2 id="&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;"><a name="&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;" class="anchor-navigation-ex-anchor" href="#&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;</h2>
<p>&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#xFF08;Functional programming&#xFF09;&#x662F;&#x4E0E;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#xFF08;Object-oriented programming&#xFF09;&#x5E76;&#x5217;&#x7684;&#x7F16;&#x7A0B;&#x8303;&#x5F0F;&#x3002;</p>
<p>&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x62BD;&#x8C61;&#x7A0B;&#x5EA6;&#x5F88;&#x9AD8;&#x7684;&#x7F16;&#x7A0B;&#x8303;&#x5F0F;&#xFF0C;&#x7EAF;&#x7CB9;&#x7684;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#x51FD;&#x6570;<a href="http://www.ruanyifeng.com/blog/2017/03/pointfree.html" target="_blank">Pointfree&#x7F16;&#x7A0B;&#x98CE;&#x683C;</a>&#x6CA1;&#x6709;&#x53D8;&#x91CF;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x53EA;&#x8981;&#x8F93;&#x5165;&#x662F;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x8F93;&#x51FA;&#x5C31;&#x662F;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x7EAF;&#x51FD;&#x6570;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&#x6CA1;&#x6709;&#x526F;&#x4F5C;&#x7528;&#x3002;&#x800C;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x53D8;&#x91CF;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#xFF0C;&#x7531;&#x4E8E;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x7684;&#x53D8;&#x91CF;&#x72B6;&#x6001;&#x4E0D;&#x786E;&#x5B9A;&#xFF0C;&#x540C;&#x6837;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x53EF;&#x80FD;&#x5F97;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x79CD;&#x51FD;&#x6570;&#x662F;&#x6709;&#x526F;&#x4F5C;&#x7528;&#x7684;&#x3002; </p>
<p>&#x5BF9;&#x8C61;&#x4E0E;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x9996;&#x8981;&#x8003;&#x8651;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x5728;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x90FD;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x51FD;&#x6570;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x6D41;&#x6765;&#x4EA4;&#x6362;&#x4FE1;&#x606F;&#xFF0C;<code>&#x51FD;&#x6570;&#x4F5C;&#x4E3A;FP&#x4E2D;&#x7684;&#x4E00;&#x7B49;&#x516C;&#x6C11;</code>&#xFF0C;&#x4EAB;&#x6709;&#x8DDF;&#x6570;&#x636E;&#x4E00;&#x6837;&#x7684;&#x5730;&#x4F4D;&#xFF0C;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x7ED9;&#x4E0B;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x8FD4;&#x56DE;&#x503C;&#x3002; </p>
<p>&#x5728;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x6570;&#x636E;&#x5168;&#x90E8;&#x90FD;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x662F;&#x591A;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x3002;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x964D;&#x4F4E;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x4E2D;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x5BF9;&#x4E8E;&#x5FEB;&#x901F;&#x8FED;&#x4EE3;&#x7684;&#x9879;&#x76EE;&#x6765;&#x8BF4;&#xFF0C;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x51FD;&#x6570;&#x4E0E;&#x51FD;&#x6570;&#x4E4B;&#x95F4;&#x7684;&#x70ED;&#x5207;&#x6362;&#x800C;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x6570;&#x636E;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x4EE5;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#x7684;&#xFF0C;&#x53EA;&#x8981;&#x51FD;&#x6570;&#x4E0E;&#x51FD;&#x6570;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x6B63;&#x786E;&#x5373;&#x53EF;&#x4FDD;&#x8BC1;&#x7ED3;&#x679C;&#x7684;&#x6B63;&#x786E;&#x6027;&#x3002;</p>
<h2 id="why-ramda"><a name="why-ramda" class="anchor-navigation-ex-anchor" href="#why-ramda"><i class="fa fa-link" aria-hidden="true"></i></a>Why Ramda</h2>
<p>Ramda&#x5F3A;&#x8C03;&#x4E00;&#x79CD;&#x66F4;&#x7EAF;&#x7CB9;&#x7684;&#x51FD;&#x6570;<code>Pure function</code>&#x98CE;&#x683C;&#xFF0C;&#x4E0D;&#x53EF;&#x53D8;&#x548C;&#x65E0;&#x526F;&#x4F5C;&#x7528;&#x662F;&#x5176;&#x8BBE;&#x8BA1;&#x7684;&#x6838;&#x5FC3;&#xFF0C;&#x5F53;&#x7ED9;&#x4E88;function&#x76F8;&#x540C;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x6C38;&#x8FDC;&#x8FD4;&#x56DE;&#x76F8;&#x540C;&#x7684;&#x503C;&#xFF0C;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x663E;&#x8457;&#x7684;&#x526F;&#x4F5C;&#x7528;<code>side effect</code>&#x3002;</p>
<pre><code class="lang-javascript"><span class="hljs-comment">//side effect&#x6307;&#x4E00;&#x4E2A;function&#x505A;&#x4E86;&#x8DDF;&#x672C;&#x8EAB;&#x8FD0;&#x7B97;&#x8FD4;&#x56DE;&#x503C;&#x6CA1;&#x6709;&#x5173;&#x7CFB;&#x7684;&#x4E8B;&#xFF0C;&#x6BD4;&#x5982;&#x53D1;&#x9001;`http request`&#x8BF7;&#x6C42;&#x6216;&#x4FEE;&#x6539;&#x67D0;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x6216;&#x4F20;&#x5165;&#x53C2;&#x6570;&#x7684;&#x503C;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x6267;&#x884C;`console.log`</span>

<span class="hljs-comment">//slice&#x4E0D;&#x7BA1;&#x6267;&#x884C;&#x591A;&#x5C11;&#x6B21;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x90FD;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x9664;&#x4E86;&#x8FD4;&#x56DE;value&#x503C;&#x5916;&#xFF0C;&#x6CA1;&#x6709;&#x505A;&#x4EFB;&#x4F55;&#x4E8B;</span>
<span class="hljs-keyword">var</span> arr = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>];
arr.slice(<span class="hljs-number">0</span>, <span class="hljs-number">3</span>); <span class="hljs-comment">// [1, 2, 3]</span>
arr.slice(<span class="hljs-number">0</span>, <span class="hljs-number">3</span>); <span class="hljs-comment">// [1, 2, 3]</span>
arr.slice(<span class="hljs-number">0</span>, <span class="hljs-number">3</span>); <span class="hljs-comment">// [1, 2, 3]</span>

<span class="hljs-comment">//splice&#x6CA1;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x5C31;&#x5F71;&#x54CD;arr&#x7684;&#x503C;&#xFF0C;&#x5BFC;&#x81F4;&#x6BCF;&#x6B21;&#x7ED3;&#x679C;&#x90FD;&#x4E0D;&#x540C;&#xFF0C;&#x4E0D;&#x7B26;&#x5408;pure function&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#x539F;&#x5219;</span>
<span class="hljs-keyword">var</span> arr = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>];
arr.splice(<span class="hljs-number">0</span>, <span class="hljs-number">3</span>); <span class="hljs-comment">// [1, 2, 3]</span>
arr.splice(<span class="hljs-number">0</span>, <span class="hljs-number">3</span>); <span class="hljs-comment">// [4, 5]</span>
arr.slice(<span class="hljs-number">0</span>, <span class="hljs-number">3</span>); <span class="hljs-comment">// []</span>
</code></pre>
<p>Ramda&#x6240;&#x6709;&#x51FD;&#x6570;&#x90FD;&#x662F;&#x81EA;&#x52A8;&#x67EF;&#x91CC;&#x5316;&#x7684;&#x3002;</p>
<pre><code class="lang-javascript">R.add(<span class="hljs-number">2</span>, <span class="hljs-number">3</span>);       <span class="hljs-comment">//=&gt;  5</span>
R.add(<span class="hljs-number">7</span>)(<span class="hljs-number">10</span>);      <span class="hljs-comment">//=&gt; 17</span>
</code></pre>
<p>Ramda&#x4E2D;&#x6570;&#x636E;&#x90FD;&#x662F;&#x4F5C;&#x4E3A;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x4F20;&#x5165;&#x7684;&#x3002;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> R = <span class="hljs-built_in">require</span>(<span class="hljs-string">&apos;ramda&apos;</span>);
R.map(square, [<span class="hljs-number">4</span>, <span class="hljs-number">8</span>]) <span class="hljs-comment">// [16, 64]</span>
</code></pre>
<p>&#x4E0D;&#x540C;&#x4E8E;underscore&#x548C;lodash&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> square = n =&gt; n * n;
_.map([<span class="hljs-number">4</span>, <span class="hljs-number">8</span>], square) <span class="hljs-comment">// [16, 64]</span>
</code></pre>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; leooman.com 2018 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x6587;&#x4EF6;&#x6700;&#x65B0;&#x53D1;&#x5E03;&#x65F6;&#x95F4;&#xFF1A;
2018-11-27 11:50:09
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="Type.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 类型Type">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Ramda及函数式编程","level":"2.1","depth":1,"next":{"title":"类型Type","level":"3.1","depth":1,"path":"Type.md","ref":"Type.md","articles":[]},"previous":{"title":"Ramda V0.25.0","level":"1.1","depth":1,"url":"https://github.com/Leooman/ramda","ref":"https://github.com/Leooman/ramda","articles":[]},"dir":"ltr"},"config":{"plugins":["simple-page-toc@^0.1.1","github@^2.0.0","splitter@^0.0.8","tbfed-pagefooter@^0.0.1","anchor-navigation-ex@0.1.8","-sharing","sharing-plus@^0.0.2"],"root":".","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © leooman.com 2018","modify_label":"文件最新发布时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"github":{"url":"https://github.com/Leooman"},"simple-page-toc":{"maxDepth":3,"skipFirstH1":true},"splitter":{},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"serif","size":2},"highlight":{},"anchor-navigation-ex":{"isRewritePageTitle":false,"tocLevel1Icon":"fa fa-hand-o-right","tocLevel2Icon":"fa fa-hand-o-right","tocLevel3Icon":"fa fa-hand-o-right"},"sharing":{"qq":false,"all":["facebook","google","twitter","weibo","instapaper","linkedin","pocket","stumbleupon","qq","qzone"],"douban":false,"facebook":false,"weibo":true,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":false,"messenger":false,"line":false,"vk":false,"pocket":false,"google":true,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":true},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Leooman","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"函数式编程Ramda","language":"zh-hans","links":{"sidebar":{}},"gitbook":"3.2.3","description":"Ramda使用"},"file":{"path":"README.md","mtime":"2018-11-27T03:50:09.234Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-11-27T06:18:05.272Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

